In [37]:
#pip install pandas
import pandas as pd
import numpy as np

In [38]:
s1=pd.Series([3,7,11,21,'721'])
s1

0      3
1      7
2     11
3     21
4    721
dtype: object

In [39]:
s2=pd.Series([3,7,11,21,721],index=['a','b','c','d','e'])
s2

a      3
b      7
c     11
d     21
e    721
dtype: int64

In [40]:
s3=pd.Series([3,7,11,21,721],index=['a','b','c','d','e'],dtype='float')
s3

a      3.0
b      7.0
c     11.0
d     21.0
e    721.0
dtype: float64

In [41]:
#creation of series using dictionary     #keys=index
s4=pd.Series({'e':7,'f':21,'c':311})
s4

e      7
f     21
c    311
dtype: int64

In [42]:
#data frame     #series+series=2d dimensional data frame
d1=pd.DataFrame([3,7,11,21])
d1

    0
0   3
1   7
2  11
3  21

In [43]:
d2=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
d2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [44]:
d2=pd.DataFrame(s2)  #converting series into dataframe
d2

     0
a    3
b    7
c   11
d   21
e  721

In [45]:
d3=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['a','b','c'])
d3

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [46]:
d3=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['a','b','c'],index=['x','y','z'])
d3

   a  b  c
x  1  2  3
y  4  5  6
z  7  8  9

In [47]:
#creating dataframe from list of dictionaries
dic=[{'shiva':1,'sweetie':2},{'neelima':3,'shinee':4,'tillu':5},{'neelima':6,'shinee':8,'tillu':9}]
pd.DataFrame(dic,index=['a','b','c'])

   shiva  sweetie  neelima  shinee  tillu
a    1.0      2.0      NaN     NaN    NaN
b    NaN      NaN      3.0     4.0    5.0
c    NaN      NaN      6.0     8.0    9.0

In [48]:
#dataframes
d3

   a  b  c
x  1  2  3
y  4  5  6
z  7  8  9

In [49]:
print(d3['a'])
print(d3['b'])

x    1
y    4
z    7
Name: a, dtype: int64
x    2
y    5
z    8
Name: b, dtype: int64

In [50]:
d3['d']=d3['a']*d3['b']
d3['e']=d3['a']+d3['d']
d3

   a  b  c   d   e
x  1  2  3   2   3
y  4  5  6  20  24
z  7  8  9  56  63

In [51]:
pop=d3.pop('b')
d3

   a  c   d   e
x  1  3   2   3
y  4  6  20  24
z  7  9  56  63

In [52]:
del d3['d']
d3

   a  c   e
x  1  3   3
y  4  6  24
z  7  9  63

In [53]:
d3.pop('a')
d3

   c   e
x  3   3
y  6  24
z  9  63

In [55]:
d3.insert(1,'new1',d3['c'])#loc,col,data
d3

   c  new1   e
x  3     3   3
y  6     6  24
z  9     9  63

In [57]:
d={'c':1,'new1':7,'e':21}
df11=d3.append(d,ignore_index=True)
df11

C:\Users\shiva\AppData\Local\Temp\ipykernel_500\2522354757.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df11=d3.append(d,ignore_index=True)

   c  new1   e
0  3     3   3
1  6     6  24
2  9     9  63
3  1     7  21

In [63]:
import numpy as np
d4=pd.DataFrame({'abc':np.random.randint(2,6,size=(10)),'bcd':np.random.randint(4,10,size=(10)),'cde':np.random.randint(3,10,size=(10))})
d4

   abc  bcd  cde
0    4    8    9
1    2    4    5
2    3    7    6
3    3    6    6
4    2    4    9
5    2    9    4
6    4    5    7
7    5    6    4
8    3    4    6
9    5    8    4

In [64]:
d4.head()           #first 5

   abc  bcd  cde
0    4    8    9
1    2    4    5
2    3    7    6
3    3    6    6
4    2    4    9

In [65]:
d4.tail()         #last 5

   abc  bcd  cde
5    2    9    4
6    4    5    7
7    5    6    4
8    3    4    6
9    5    8    4

In [68]:
d4.info()     #information about data ,datatypes and memory usage
d4.describe()  #describe about count,mean,min,max,%,std

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   abc     10 non-null     int32
 1   bcd     10 non-null     int32
 2   cde     10 non-null     int32
dtypes: int32(3)
memory usage: 248.0 bytes

             abc        bcd        cde
count  10.000000  10.000000  10.000000
mean    3.300000   6.100000   6.000000
std     1.159502   1.852926   1.885618
min     2.000000   4.000000   4.000000
25%     2.250000   4.250000   4.250000
50%     3.000000   6.000000   6.000000
75%     4.000000   7.750000   6.750000
max     5.000000   9.000000   9.000000

In [69]:
d4

   abc  bcd  cde
0    4    8    9
1    2    4    5
2    3    7    6
3    3    6    6
4    2    4    9
5    2    9    4
6    4    5    7
7    5    6    4
8    3    4    6
9    5    8    4

In [71]:
d4.loc[4,'cde']   #loc[row name,colname]

9

In [72]:
d4

   abc  bcd  cde
0    4    8    9
1    2    4    5
2    3    7    6
3    3    6    6
4    2    4    9
5    2    9    4
6    4    5    7
7    5    6    4
8    3    4    6
9    5    8    4

In [74]:
d4.loc[2:8,['abc','cde']]

   abc  cde
2    3    6
3    3    6
4    2    9
5    2    4
6    4    7
7    5    4
8    3    6

In [75]:
d4.loc[[3,4,5],['abc','cde']]

   abc  cde
3    3    6
4    2    9
5    2    4

In [76]:
d4

   abc  bcd  cde
0    4    8    9
1    2    4    5
2    3    7    6
3    3    6    6
4    2    4    9
5    2    9    4
6    4    5    7
7    5    6    4
8    3    4    6
9    5    8    4

In [77]:
d4.abc

0    4
1    2
2    3
3    3
4    2
5    2
6    4
7    5
8    3
9    5
Name: abc, dtype: int32

In [78]:
d4.abc.values  #dataframe,column,values

array([4, 2, 3, 3, 2, 2, 4, 5, 3, 5])

In [79]:
d4['sub']=d4.abc.values-d4.cde.values-d4.bcd.values
d4

   abc  bcd  cde  sub
0    4    8    9  -13
1    2    4    5   -7
2    3    7    6  -10
3    3    6    6   -9
4    2    4    9  -11
5    2    9    4  -11
6    4    5    7   -8
7    5    6    4   -5
8    3    4    6   -7
9    5    8    4   -7

In [80]:
a=[['sp',100,15000],['shiva',101,20000],['prasad',102,25000]]
df1=pd.DataFrame(a,columns=['name','id','salary'])
df1

     name   id  salary
0      sp  100   15000
1   shiva  101   20000
2  prasad  102   25000

In [81]:
y=df1[df1.salary>=20000]
print(y)
y[['id','salary']]

     name   id  salary
1   shiva  101   20000
2  prasad  102   25000

    id  salary
1  101   20000
2  102   25000

In [82]:
df1.append({'name':'rajesh','id':103,'salary':30000},ignore_index=True)

C:\Users\shiva\AppData\Local\Temp\ipykernel_500\2830251196.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append({'name':'rajesh','id':103,'salary':30000},ignore_index=True)

     name   id  salary
0      sp  100   15000
1   shiva  101   20000
2  prasad  102   25000
3  rajesh  103   30000

In [83]:
df1=df1.append({'name':np.nan,'id':103,'salary':30000},ignore_index=True)
df1

C:\Users\shiva\AppData\Local\Temp\ipykernel_500\268482129.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1=df1.append({'name':np.nan,'id':103,'salary':30000},ignore_index=True)

     name     id   salary
0      sp  100.0  15000.0
1   shiva  101.0  20000.0
2  prasad  102.0  25000.0
3     NaN  103.0  30000.0

In [84]:
df1.isnull()

    name     id  salary
0  False  False   False
1  False  False   False
2  False  False   False
3   True  False   False

In [85]:
print(df1.isnull().sum())

name      1
id        0
salary    0
dtype: int64

In [86]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   id      4 non-null      float64
 2   salary  4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 224.0+ bytes

In [87]:
df1.dropna()

     name     id   salary
0      sp  100.0  15000.0
1   shiva  101.0  20000.0
2  prasad  102.0  25000.0

In [88]:
df1

     name     id   salary
0      sp  100.0  15000.0
1   shiva  101.0  20000.0
2  prasad  102.0  25000.0
3     NaN  103.0  30000.0

In [90]:
df1.fillna(value='abc')

     name     id   salary
0      sp  100.0  15000.0
1   shiva  101.0  20000.0
2  prasad  102.0  25000.0
3     abc  103.0  30000.0

In [91]:
df1

     name     id   salary
0      sp  100.0  15000.0
1   shiva  101.0  20000.0
2  prasad  102.0  25000.0
3     NaN  103.0  30000.0

In [92]:
df1.drop([0],axis=0,inplace=True)
df1

     name     id   salary
1   shiva  101.0  20000.0
2  prasad  102.0  25000.0
3     NaN  103.0  30000.0

In [93]:
#groupby
df=pd.DataFrame({'birds':['sparrow','sparrow','parrot','parrot'],'max speed':[100.,200.,30.,40.],'wind speed':[100.,200.,30.,40.]})
df

     birds  max speed  wind speed
0  sparrow      100.0       100.0
1  sparrow      200.0       200.0
2   parrot       30.0        30.0
3   parrot       40.0        40.0

In [95]:
df.groupby(['birds']).mean()

         max speed  wind speed
birds
parrot        35.0        35.0
sparrow      150.0       150.0

In [2]:
import pandas as pd
df_csv =('data.csv') #df_csv=pd.read_csv('data.csv')
df_csv

'data.csv'

In [106]:
print(df_csv.columns)
df_csv.isnull().sum()
df_csv['COUNTRY'].values
df_csv['COUNTRY'].isnull().sum

AttributeError: 'str' object has no attribute 'columns'

In [3]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random.randn(4,3),columns=['col1','col2','col3'])
print(df)
for key,value in df.iteritems():
    print(key,value)
    print('\n')

       col1      col2      col3
0  0.598539 -0.543680  2.089113
1 -0.305915 -0.775001  0.487339
2  0.250646 -0.507114 -0.326997
3  1.057279 -1.379442  1.098341
col1 0    0.598539
1   -0.305915
2    0.250646
3    1.057279
Name: col1, dtype: float64


col2 0   -0.543680
1   -0.775001
2   -0.507114
3   -1.379442
Name: col2, dtype: float64


col3 0    2.089113
1    0.487339
2   -0.326997
3    1.098341
Name: col3, dtype: float64

In [4]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random,randn(3,3),columns=['col1','col2','col3'])
print(df)
print('\n')
for row in df.iterrows():
    print(row)
    print('\n')

NameError: name 'randn' is not defined

In [107]:
#pd.series?
#Transpose
df.T

                  0        1       2       3
birds       sparrow  sparrow  parrot  parrot
max speed     100.0    200.0    30.0    40.0
wind speed    100.0    200.0    30.0    40.0

In [113]:
#get dummies
import pandas as pd
data={'firstname':['Musham','Karupakala'],
      'lastname':['Neelima','Shivaprasad'],
      'employmenttype':['student','business'],
      'country':['india','usa']}
df = pd.DataFrame(data, columns = ['firstname','lastname','employmenttype','country'])
print(df)

    firstname     lastname employmenttype country
0      Musham      Neelima        student   india
1  Karupakala  Shivaprasad       business     usa

In [115]:
df1=pd.get_dummies(df['employmenttype'])
df2=pd.get_dummies(df['country'])
print(df1)
print(df2)

   business  student
0         0        1
1         1        0
   india  usa
0      1    0
1      0    1

In [116]:
df

    firstname     lastname employmenttype country
0      Musham      Neelima        student   india
1  Karupakala  Shivaprasad       business     usa

In [117]:
frames=[df,df1,df2]
result=pd.concat(frames,axis=1)
result.drop(['employmenttype','country'],axis=1,inplace=True)
result

    firstname     lastname  business  student  india  usa
0      Musham      Neelima         0        1      1    0
1  Karupakala  Shivaprasad         1        0      0    1

In [118]:
#concatination
import pandas as pd
india_weather=pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,78,76],
    "humidity":[56,34,39]
})
india_weather

       city  temperature  humidity
0    mumbai           32        56
1     delhi           78        34
2  banglore           76        39

In [121]:
us_weather=pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[34,41,50],
    "humidity":[68,54,78]
})
us_weather

       city  temperature  humidity
0  new york           34        68
1   chicago           41        54
2   orlando           50        78

In [120]:
df=pd.concat([india_weather,us_weather])
df

       city  temperature  humidity
0    mumbai           32        56
1     delhi           78        34
2  banglore           76        39
0  new york           34        68
1   chicago           41        54
2   orlando           50        78

In [122]:
#ignore index
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        56
1     delhi           78        34
2  banglore           76        39
3  new york           34        68
4   chicago           41        54
5   orlando           50        78

In [123]:
#concatinate using keys
df=pd.concat([india_weather,us_weather],keys=["india","us"])
df

             city  temperature  humidity
india 0    mumbai           32        56
      1     delhi           78        34
      2  banglore           76        39
us    0  new york           34        68
      1   chicago           41        54
      2   orlando           50        78

In [5]:
#finding relationships    corr()method
df=pd.read_csv('data_panda.csv')
df.corr()

FileNotFoundError: [Errno 2] No such file or directory: 'data_panda.csv'

In [125]:
import pandas as pd
emp={"name":["parker","smith","william","parker"],
"age":[21,34,56,29]}
info=pd.DataFrame(emp)
print(info)
print("-------------------")
info=info.drop_duplicates()
print(info)

      name  age
0   parker   21
1    smith   34
2  william   56
3   parker   29
-------------------
      name  age
0   parker   21
1    smith   34
2  william   56
3   parker   29

In [127]:

def calc_sum(neelima):
    return neelima+1
data={
    "x":[30,50,80],
    "y":[380,777,900]
}
df=pd.DataFrame(data)
print(df)
x=df.apply(calc_sum)
print(x)

    x    y
0  30  380
1  50  777
2  80  900
    x    y
0  31  381
1  51  778
2  81  901